---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.TextFailures.ModeltextIsEmpty
source: html/8c14448b-433a-c29b-42e3-9f2bb7704b70.htm
---
# Autodesk.Revit.DB.BuiltInFailures.TextFailures.ModeltextIsEmpty Property

Model Text deleted because it consists entirely of spaces and/or carriage returns.

## Syntax (C#)
```csharp
public static FailureDefinitionId ModeltextIsEmpty { get; }
```